export const rawText: string[] = [
  "ท้าวสุทัศน์และพระนางประทุมเกสร ผู้ครองกรุงรัตนา มีพระโอรสสององค์ คือ พระอภัยมณี และศรีสุวรรณ ได้รับสั่งให้โอรสทั้งสองไปเรียนศิลปวิทยา ในที่สุดพระอภัยมณีได้เรียนวิชาปี่ ขณะที่ศรีสุวรรณได้เรียนวิชากระบี่กระบอง เมื่อสำเร็จวิชา ก็ได้กลับคืนพระนคร ทว่าพระบิดาทรงกริ้ว ด้วยพระโอรสไปเรียนวิชาชั้นต่ำ ไม่คู่ควรแก่กษัตริย์ จึงไล่ทั้งสองออกจากพระนคร",
  "ทั้งสองเดินทางมาถึงชายทะเล ได้พบกับสามพราหมณ์คือ โมรา สานนท์ และวิเชียร ได้สมัครเป็นมิตรกัน แล้วพระอภัยมณีเป่าปี่ให้คนทั้งหมดฟัง ทั้งหมดเคลิบเคลิ้มตามเพลงปี่จนหลับไป เพลงปี่ดังไปถึงนางผีเสื้อสมุทรที่อาศัยอยู่ในทะเล เมื่อตามเสียงปี่มาพบพระอภัยมณีก็หลงรัก จึงลักพาตัวพระอภัยมณีไปอยู่กับนางบนเกาะ แล้วจำแลงร่างเป็นหญิงสาวสวยงาม แม้พระอภัยรู้อยู่ว่านั่นคือนางยักษ์ แต่ก็ไม่สามารถหนีไปไหนได้ ทั้งสองอยู่กินกันมาจนนางผีเสื้อให้กำเนิดบุตรชายคนหนึ่ง ชื่อว่า สินสมุทร",
  "ด้านศรีสุวรรณกับสามพราหมณ์เมื่อตื่นขึ้นมาไม่พบพระอภัยมณีก็เที่ยวค้นหา จนไปถึงเมืองรมจักรพบศึกติดพัน ศรีสุวรรณกับสามพราหมณ์ช่วยรบป้องกันเมืองได้ ได้พบนางเกษราธิดาของเจ้าเมือง ต่อมาศรีสุวรรณได้อภิเษกนางเกษรา มีพระธิดาชื่อนางอรุณรัศมี",
  "วันหนึ่งสินสมุทรออกไปเที่ยวเล่นเจอพ่อเงือกแม่เงือก จึงจับตัวมาให้พระอภัยดู พ่อเงือกแม่เงือกวอนขอชีวิตโดยเสนอจะพาพระอภัยมณีหนี พระอภัยจึงออกอุบายให้นางผีเสื้อไปถือศีลบนเขาสามวัน ระหว่างนั้นเขาก็พาสินสมุทรหนี พ่อเงือกแม่เงือกพาพระอภัยและสินสมุทรมาเกือบถึงเกาะแก้วพิสดารแล้ว แต่นางผีเสื้อรู้ตัวติดตามมาทัน จับพ่อเงือกแม่เงือกฆ่าเสีย นางเงือกผู้ลูกพาพระอภัยกับสินสมุทรหนีไปจนถึงเกาะแก้วพิสดารได้สำเร็จ บนเกาะนี้มีพระฤๅษีมีฤทธิ์มาก นางผีเสื้อจึงไม่กล้าทำอะไร ทั้งหมดอาศัยอยู่บนเกาะแก้วพิสดาร พระอภัยได้นางเงือกเป็นภรรยา",
  "ฝ่ายท้าวสิลราชกับพระนางมณฑา ผู้ครองเมืองเมืองผลึก มีพระธิดาองค์เดียวคือ นางสุวรรณมาลี ทรงเป็นคู่หมั้นอยู่กับอุศเรน เจ้าชายเมืองลังกา วันหนึ่งนางสุวรรณมาลีเกิดนิมิตฝัน โหรทำนายว่าต้องออกเที่ยวทะเลจะได้พบลาภ ทั้งหมดจึงเดินเรือเที่ยวท่องไป แต่เกิดพายุใหญ่พัดเรือไปถึงเกาะนาควาริน คำทำนายของปู่เจ้าทำให้ท้าวสิลราชพากองเรือมุ่งหน้าไปยังเกาะแก้วพิสดาร ได้พบพระอภัยมณีและรับพระอภัยมณีกับสินสมุทรขึ้นเรือไปด้วยเพื่ออาศัยกลับบ้านเมือง แต่เมื่อเรือออกจากเกาะ นางผีเสื้อสมุทรก็มาอาละวาดอีกจนเรือแตก ท้าวสิลราชกับบริวารส่วนใหญ่สิ้นชีพ สินสมุทรพานางสุวรรณมาลีหนีไปได้ พระอภัยมณีเป่าปี่สังหารนางยักษ์",
  "ทั้งหมดแตกกระจายพลัดพรายจากกัน พระอภัยมณีได้รับความช่วยเหลือจากอุศเรน คู่หมั้นของนางสุวรรณมาลี ที่ออกเรือมาตามหาเพราะหายไปนาน ส่วนสินสมุทรกับนางสุวรรณมาลีได้โจรสุหรั่ง โจรสลัดในน่านน้ำนั้นช่วยไว้ได้ แต่โจรคิดทำร้าย สินสมุทรจึงสังหารโจรแล้วครองเรือมาเอง แล้วได้พบศรีสุวรรณที่ออกล่องเรือเที่ยวตามหาพี่ชาย ทั้งหมดเดินทางไปด้วยกันจนมาพบพระอภัยมณีกับอุศเรน สินสมุทรรักนางสุวรรณมาลีอยากได้เป็นแม่ จึงเกิดวิวาทกับอุศเรน พระอภัยมณีไปเมืองผลึกกับนางสุวรรณมาลีและได้ขึ้นครองเมืองแทนท้าวสิลราช อุศเรนแค้นและกลับเมืองลังกายกทัพมาตีเมืองผลึก แต่แพ้อุบายนางวาลีจนสิ้นชีวิต นางละเวงวัณฬาผู้น้องสาวคิดแก้แค้น จึงใช้รูปของตนทำเสน่ห์ส่งไปหัวเมืองต่าง ๆ ให้ยกทัพมาตีเมืองผลึก"
];

export type TextToUnicode = {
  [key: string]: string
}

export const sampleCode = {
  "ก": "&#x0E01;",
  "ข": "&#x0E02;",
  // ...
  // "น": "&#xE024;", //custom and not found in Saraban font range
  // ...
}

export type responseAPI = {
  data: string[]
}
